#include <iostream>
using namespace std;
int main() {
	setlocale(LC_ALL, "Russian");
	float a1; // перша координата вектора a
	float a2; // друга координата вектора а
	float a3; // третя координата вектора а
	float b1; // перша координата вектора b
	float b2; // друга координата вектора b
	float b3; // третя координата вектора b
	cout << "Введiть першу координату вектора а: ";
	cin >> a1;
	cout << "Введiть другу координату вектора а: ";
	cin >> a2;
	cout << "Введiть третю координату вектора а: ";
	cin >> a3;
	cout << "Введiть першу координату вектора b: ";
	cin >> b1;
	cout << "Введiть другу координату вектора b: ";
	cin >> b2;
	cout << "Введiть третю координату вектора b: ";
	cin >> b3;
	if (a1 / b1 == a2 / b2)
		if (a2 / b2 == a3 / b3)
			cout << "векториa а i b колiнеарнi";
		else cout << "Вектори а i b не колiнеарнi";
	else cout << "Вектори а i b не колiнеарнi";
}